#include <stdio.h>

int main (void)
{
	int i;
	int *p[3];
	int a[3][4] = {1,2,3};
	
	for(i=0; i<3; i++)
		p[i]=a[i];				//这样子我们也可以访问二维数组了，a[i]就表示是那个整体数组的
								//首元素的首地址
	
	a[1][2] = 4;
	printf("%p\n", a[1]);			//a[i]只是个地址来的，不能输出数字
	printf("p = %d\n", *(*(p+1)+2));
	
	/*
	int *p1;
	int (*p)[5];			//数组指针，指向有5个元素的整型的数组
	int a[2][5]={1,2,3,4,5};
	
	p = a;				//如果a是一维数组的时候，就要在a前面加&符号，二维数组的时候就这样写
	
	printf("%p\n", *p);		//这里的*p就代表着整个数组了，*(p+2)就向前推进了两个数组的大小
	printf("%d\n", *(*(p+1)+4));		//数组指针似乎是c语言中专门用来指向二维数组的
	*/
	
/*
	int gg[1] = {1};
	//*p1其实就是p2,**p1其实就是*p2
	int **p1;
	int *p2;
	int a = 10;
	int b = 20;
	
	p1 = &p2;
	p2 = &a;
	
	*p1 = &b;
	
	printf("p1 = %d, p2 = %d.\n", **p1, *p2);
	
*/
	
	return 0;
}
























